Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEmem_mpu_reg.h
/** \brief 70, EMEM Module Region i Lower Address Register */
#define EMEMMPU2_RGNWRN2_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB020070u)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN2_RGNLA.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN2_RGNLA.
*/
#define EMEMMPU2_RGNLA2 (EMEMMPU2_RGNWRN2_RGNLA)

/** \brief 74, EMEM Module Region i Upper Address Register */
#define EMEMMPU2_RGNWRN2_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB020074u)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN2_RGNUA.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN2_RGNUA.
*/
#define EMEMMPU2_RGNUA2 (EMEMMPU2_RGNWRN2_RGNUA)

/** \brief 78, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU2_RGNWRN2_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB020078u)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN2_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN2_RGNACCENWA.
*/
#define EMEMMPU2_RGNACCENWA2 (EMEMMPU2_RGNWRN2_RGNACCENWA)

/** \brief 7C, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU2_RGNWRN2_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB02007Cu)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN2_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN2_RGNACCENWB.
*/
#define EMEMMPU2_RGNACCENWB2 (EMEMMPU2_RGNWRN2_RGNACCENWB)

/** \brief 80, EMEM Module Region i Lower Address Register */
#define EMEMMPU2_RGNWRN3_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB020080u)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN3_RGNLA.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN3_RGNLA.
*/
#define EMEMMPU2_RGNLA3 (EMEMMPU2_RGNWRN3_RGNLA)

/** \brief 84, EMEM Module Region i Upper Address Register */
#define EMEMMPU2_RGNWRN3_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB020084u)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN3_RGNUA.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN3_RGNUA.
*/
#define EMEMMPU2_RGNUA3 (EMEMMPU2_RGNWRN3_RGNUA)

/** \brief 88, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU2_RGNWRN3_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB020088u)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN3_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN3_RGNACCENWA.
*/
#define EMEMMPU2_RGNACCENWA3 (EMEMMPU2_RGNWRN3_RGNACCENWA)

/** \brief 8C, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU2_RGNWRN3_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB02008Cu)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN3_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN3_RGNACCENWB.
*/
#define EMEMMPU2_RGNACCENWB3 (EMEMMPU2_RGNWRN3_RGNACCENWB)

/** \brief 90, EMEM Module Region i Lower Address Register */
#define EMEMMPU2_RGNWRN4_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB020090u)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN4_RGNLA.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN4_RGNLA.
*/
#define EMEMMPU2_RGNLA4 (EMEMMPU2_RGNWRN4_RGNLA)

/** \brief 94, EMEM Module Region i Upper Address Register */
#define EMEMMPU2_RGNWRN4_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB020094u)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN4_RGNUA.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN4_RGNUA.
*/
#define EMEMMPU2_RGNUA4 (EMEMMPU2_RGNWRN4_RGNUA)

/** \brief 98, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU2_RGNWRN4_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB020098u)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN4_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN4_RGNACCENWA.
*/
#define EMEMMPU2_RGNACCENWA4 (EMEMMPU2_RGNWRN4_RGNACCENWA)

/** \brief 9C, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU2_RGNWRN4_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB02009Cu)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN4_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN4_RGNACCENWB.
*/
#define EMEMMPU2_RGNACCENWB4 (EMEMMPU2_RGNWRN4_RGNACCENWB)

/** \brief A0, EMEM Module Region i Lower Address Register */
#define EMEMMPU2_RGNWRN5_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB0200A0u)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN5_RGNLA.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN5_RGNLA.
*/
#define EMEMMPU2_RGNLA5 (EMEMMPU2_RGNWRN5_RGNLA)

/** \brief A4, EMEM Module Region i Upper Address Register */
#define EMEMMPU2_RGNWRN5_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB0200A4u)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN5_RGNUA.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN5_RGNUA.
*/
#define EMEMMPU2_RGNUA5 (EMEMMPU2_RGNWRN5_RGNUA)

/** \brief A8, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU2_RGNWRN5_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB0200A8u)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN5_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN5_RGNACCENWA.
*/
#define EMEMMPU2_RGNACCENWA5 (EMEMMPU2_RGNWRN5_RGNACCENWA)

/** \brief AC, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU2_RGNWRN5_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB0200ACu)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN5_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN5_RGNACCENWB.
*/
#define EMEMMPU2_RGNACCENWB5 (EMEMMPU2_RGNWRN5_RGNACCENWB)

/** \brief B0, EMEM Module Region i Lower Address Register */
#define EMEMMPU2_RGNWRN6_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB0200B0u)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN6_RGNLA.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN6_RGNLA.
*/
#define EMEMMPU2_RGNLA6 (EMEMMPU2_RGNWRN6_RGNLA)

/** \brief B4, EMEM Module Region i Upper Address Register */
#define EMEMMPU2_RGNWRN6_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB0200B4u)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN6_RGNUA.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN6_RGNUA.
*/
#define EMEMMPU2_RGNUA6 (EMEMMPU2_RGNWRN6_RGNUA)

/** \brief B8, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU2_RGNWRN6_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB0200B8u)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN6_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN6_RGNACCENWA.
*/
#define EMEMMPU2_RGNACCENWA6 (EMEMMPU2_RGNWRN6_RGNACCENWA)

/** \brief BC, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU2_RGNWRN6_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB0200BCu)
/** Alias (User Manual Name) for EMEMMPU2_RGNWRN6_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU2_RGNWRN6_RGNACCENWB.
*/
#define EMEMMPU2_RGNACCENWB6 (EMEMMPU2_RGNWRN6_RGNACCENWB)

