Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEmem_mpu_reg.h
/** \brief 12C, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU2_RGNACCEN5_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB02012Cu)
/** Alias (User Manual Name) for EMEMMPU2_RGNACCEN5_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU2_RGNACCEN5_RGNACCENRB.
*/
#define EMEMMPU2_RGNACCENRB5 (EMEMMPU2_RGNACCEN5_RGNACCENRB)

/** \brief 138, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU2_RGNACCEN6_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB020138u)
/** Alias (User Manual Name) for EMEMMPU2_RGNACCEN6_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU2_RGNACCEN6_RGNACCENRA.
*/
#define EMEMMPU2_RGNACCENRA6 (EMEMMPU2_RGNACCEN6_RGNACCENRA)

/** \brief 13C, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU2_RGNACCEN6_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB02013Cu)
/** Alias (User Manual Name) for EMEMMPU2_RGNACCEN6_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU2_RGNACCEN6_RGNACCENRB.
*/
#define EMEMMPU2_RGNACCENRB6 (EMEMMPU2_RGNACCEN6_RGNACCENRB)

/** \brief 148, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU2_RGNACCEN7_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB020148u)
/** Alias (User Manual Name) for EMEMMPU2_RGNACCEN7_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU2_RGNACCEN7_RGNACCENRA.
*/
#define EMEMMPU2_RGNACCENRA7 (EMEMMPU2_RGNACCEN7_RGNACCENRA)

/** \brief 14C, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU2_RGNACCEN7_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB02014Cu)
/** Alias (User Manual Name) for EMEMMPU2_RGNACCEN7_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU2_RGNACCEN7_RGNACCENRB.
*/
#define EMEMMPU2_RGNACCENRB7 (EMEMMPU2_RGNACCEN7_RGNACCENRB)

/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxSfr_Emem_mpu_Registers_Cfg_Ememmpu3
 * \{  */
/** \brief 0, EMEM Module Clock Control Register */
#define EMEMMPU3_CLC /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_CLC*)0xFB030000u)

/** \brief 8, EMEM Module ID Register */
#define EMEMMPU3_MODID /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_MODID*)0xFB030008u)

/** \brief 10, EMEM Module Access Enable Register 0 */
#define EMEMMPU3_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_ACCEN0*)0xFB030010u)

/** \brief 14, EMEM Module Access Enable Register 1 */
#define EMEMMPU3_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_ACCEN1*)0xFB030014u)

/** \brief 20, EMEM Module Memory Control Register */
#define EMEMMPU3_MEMCON /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_MEMCON*)0xFB030020u)

/** \brief 24, EMEM Module Safety Control Register */
#define EMEMMPU3_SCTRL /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_SCTRL*)0xFB030024u)

/** \brief 50, EMEM Module Region i Lower Address Register */
#define EMEMMPU3_RGNWRN0_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB030050u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN0_RGNLA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN0_RGNLA.
*/
#define EMEMMPU3_RGNLA0 (EMEMMPU3_RGNWRN0_RGNLA)

/** \brief 54, EMEM Module Region i Upper Address Register */
#define EMEMMPU3_RGNWRN0_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB030054u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN0_RGNUA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN0_RGNUA.
*/
#define EMEMMPU3_RGNUA0 (EMEMMPU3_RGNWRN0_RGNUA)

/** \brief 58, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU3_RGNWRN0_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB030058u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN0_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN0_RGNACCENWA.
*/
#define EMEMMPU3_RGNACCENWA0 (EMEMMPU3_RGNWRN0_RGNACCENWA)

/** \brief 5C, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU3_RGNWRN0_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB03005Cu)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN0_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN0_RGNACCENWB.
*/
#define EMEMMPU3_RGNACCENWB0 (EMEMMPU3_RGNWRN0_RGNACCENWB)

/** \brief 60, EMEM Module Region i Lower Address Register */
#define EMEMMPU3_RGNWRN1_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB030060u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN1_RGNLA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN1_RGNLA.
*/
#define EMEMMPU3_RGNLA1 (EMEMMPU3_RGNWRN1_RGNLA)

/** \brief 64, EMEM Module Region i Upper Address Register */
#define EMEMMPU3_RGNWRN1_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB030064u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN1_RGNUA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN1_RGNUA.
*/
#define EMEMMPU3_RGNUA1 (EMEMMPU3_RGNWRN1_RGNUA)

/** \brief 68, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU3_RGNWRN1_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB030068u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN1_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN1_RGNACCENWA.
*/
#define EMEMMPU3_RGNACCENWA1 (EMEMMPU3_RGNWRN1_RGNACCENWA)

/** \brief 6C, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU3_RGNWRN1_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB03006Cu)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN1_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN1_RGNACCENWB.
*/
#define EMEMMPU3_RGNACCENWB1 (EMEMMPU3_RGNWRN1_RGNACCENWB)

