Kim-Hyundo/CSA_SW_TEST_SOLUTION/Workspace/MANDO_FailSafe_Integration/Target_SW/BSW/Modules/b_pf_autosar_tc39x_bundle/delivery/generic_TC39X_inc/IfxEmem_mpu_reg.h
/** \brief C0, EMEM Module Region i Lower Address Register */
#define EMEMMPU3_RGNWRN7_RGNLA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNLA*)0xFB0300C0u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN7_RGNLA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN7_RGNLA.
*/
#define EMEMMPU3_RGNLA7 (EMEMMPU3_RGNWRN7_RGNLA)

/** \brief C4, EMEM Module Region i Upper Address Register */
#define EMEMMPU3_RGNWRN7_RGNUA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNUA*)0xFB0300C4u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN7_RGNUA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN7_RGNUA.
*/
#define EMEMMPU3_RGNUA7 (EMEMMPU3_RGNWRN7_RGNUA)

/** \brief C8, EMEM Module Region i Write Access Enable Register 0 */
#define EMEMMPU3_RGNWRN7_RGNACCENWA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWA*)0xFB0300C8u)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN7_RGNACCENWA.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN7_RGNACCENWA.
*/
#define EMEMMPU3_RGNACCENWA7 (EMEMMPU3_RGNWRN7_RGNACCENWA)

/** \brief CC, EMEM Module Region i Write Access Enable Register 1 */
#define EMEMMPU3_RGNWRN7_RGNACCENWB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNWRN_RGNACCENWB*)0xFB0300CCu)
/** Alias (User Manual Name) for EMEMMPU3_RGNWRN7_RGNACCENWB.
* To use register names with standard convension, please use EMEMMPU3_RGNWRN7_RGNACCENWB.
*/
#define EMEMMPU3_RGNACCENWB7 (EMEMMPU3_RGNWRN7_RGNACCENWB)

/** \brief D8, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU3_RGNACCEN0_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB0300D8u)
/** Alias (User Manual Name) for EMEMMPU3_RGNACCEN0_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU3_RGNACCEN0_RGNACCENRA.
*/
#define EMEMMPU3_RGNACCENRA0 (EMEMMPU3_RGNACCEN0_RGNACCENRA)

/** \brief DC, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU3_RGNACCEN0_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB0300DCu)
/** Alias (User Manual Name) for EMEMMPU3_RGNACCEN0_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU3_RGNACCEN0_RGNACCENRB.
*/
#define EMEMMPU3_RGNACCENRB0 (EMEMMPU3_RGNACCEN0_RGNACCENRB)

/** \brief E8, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU3_RGNACCEN1_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB0300E8u)
/** Alias (User Manual Name) for EMEMMPU3_RGNACCEN1_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU3_RGNACCEN1_RGNACCENRA.
*/
#define EMEMMPU3_RGNACCENRA1 (EMEMMPU3_RGNACCEN1_RGNACCENRA)

/** \brief EC, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU3_RGNACCEN1_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB0300ECu)
/** Alias (User Manual Name) for EMEMMPU3_RGNACCEN1_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU3_RGNACCEN1_RGNACCENRB.
*/
#define EMEMMPU3_RGNACCENRB1 (EMEMMPU3_RGNACCEN1_RGNACCENRB)

/** \brief F8, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU3_RGNACCEN2_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB0300F8u)
/** Alias (User Manual Name) for EMEMMPU3_RGNACCEN2_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU3_RGNACCEN2_RGNACCENRA.
*/
#define EMEMMPU3_RGNACCENRA2 (EMEMMPU3_RGNACCEN2_RGNACCENRA)

/** \brief FC, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU3_RGNACCEN2_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB0300FCu)
/** Alias (User Manual Name) for EMEMMPU3_RGNACCEN2_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU3_RGNACCEN2_RGNACCENRB.
*/
#define EMEMMPU3_RGNACCENRB2 (EMEMMPU3_RGNACCEN2_RGNACCENRB)

/** \brief 108, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU3_RGNACCEN3_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB030108u)
/** Alias (User Manual Name) for EMEMMPU3_RGNACCEN3_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU3_RGNACCEN3_RGNACCENRA.
*/
#define EMEMMPU3_RGNACCENRA3 (EMEMMPU3_RGNACCEN3_RGNACCENRA)

/** \brief 10C, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU3_RGNACCEN3_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB03010Cu)
/** Alias (User Manual Name) for EMEMMPU3_RGNACCEN3_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU3_RGNACCEN3_RGNACCENRB.
*/
#define EMEMMPU3_RGNACCENRB3 (EMEMMPU3_RGNACCEN3_RGNACCENRB)

/** \brief 118, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU3_RGNACCEN4_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB030118u)
/** Alias (User Manual Name) for EMEMMPU3_RGNACCEN4_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU3_RGNACCEN4_RGNACCENRA.
*/
#define EMEMMPU3_RGNACCENRA4 (EMEMMPU3_RGNACCEN4_RGNACCENRA)

/** \brief 11C, EMEM Module Region i Read Access Enable Register 1 */
#define EMEMMPU3_RGNACCEN4_RGNACCENRB /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRB*)0xFB03011Cu)
/** Alias (User Manual Name) for EMEMMPU3_RGNACCEN4_RGNACCENRB.
* To use register names with standard convension, please use EMEMMPU3_RGNACCEN4_RGNACCENRB.
*/
#define EMEMMPU3_RGNACCENRB4 (EMEMMPU3_RGNACCEN4_RGNACCENRB)

/** \brief 128, EMEM Module Region i Read Access Enable Register 0 */
#define EMEMMPU3_RGNACCEN5_RGNACCENRA /*lint --e(923, 9078)*/ (*(volatile Ifx_EMEM_MPU_RGNACCEN_RGNACCENRA*)0xFB030128u)
/** Alias (User Manual Name) for EMEMMPU3_RGNACCEN5_RGNACCENRA.
* To use register names with standard convension, please use EMEMMPU3_RGNACCEN5_RGNACCENRA.
*/
#define EMEMMPU3_RGNACCENRA5 (EMEMMPU3_RGNACCEN5_RGNACCENRA)

